app/controllers/clicks_controller.rb

INSERT INTO `clicks` (`referral`, `updated_at`, `tags`, `useragent`, `ip_address`, `created_at`) VALUES('testing', '2009-03-09 20:00:26', 'this', NULL, NULL, '2009-03-09 20:00:26')
---
  def new
    if Clicks.create(:referral => params[:ref], :tags => params[:tags], :ip_address => request.remote_ip, :useragent => request.env['HTTP_USER_AGENT'] )