app/controllers/reports_controller.rb

  def index
    @output = Clicks.find(:all, :order => "created_at DESC")
---
SELECT * FROM `clicks` WHERE (`clicks`.`created_at` BETWEEN '2009-02-17' AND '2009-03-17') ORDER BY created_at DESC